// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).


Console.WriteLine("Write a number a: ");
int a = int.Parse(Console.ReadLine());

a/2;
if (a == 0)
Console.WriteLine("четное");
else
Console.WriteLine("нечетное");