//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine ("Write a numberа:");
Console.WriteLine ("Write b numberb:");

int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
Console.Write("max=");
if a > b;
Console.WriteLine(a);
else
{Console.WriteLine(b);
    
}




