// Напишите программу, которая на вход принимает число 
// и выдает его квадрат (число умноженное на само себя);

Console.WriteLine ("Write a number:");

int a = int.Parse(Console.ReadLine());
Console.WriteLine(a * a);




