// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

void Method (int a, int b)

  {
        Console.WriteLine(Math.Pow(a, b));
      
    };

Method (3,5);

