//Напишите программу, которая 
//принимает на вход число N и выдаёт 
//произведение чисел от 1 до N.

void Length (int a)
{
    string num = a.ToString();
    Console.WriteLine (num.Length);
}
Length(167);
